app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("avatar", "body", "created_at", "tite", "updated_at") VALUES (?, ?, ?, ?, ?)  [["avatar", nil], ["body", "sfdj"], ["created_at", "2014-11-20 23:39:57.770552"], ["tite", "oidjsdj"], ["updated_at", "2014-11-20 23:39:57.770552"]]